# -*- coding: utf-8 -*-
from pymongo import MongoClient

class Mongo_Database(object):

    def __init__(self):
        self.client = MongoClient(host='127.0.0.1', port=27017)
        self.client.admin.authenticate('root','abc123456')
        self.db = self.client['xiaoshuo']

    def insert_data(self,data):
        print('正在存储正文：',data['zhangjie_index'])
        collection_name = data['shu_name']
        collection = self.db[collection_name]
        data = dict(data)
        collection.update({'zhangjie_index':data['zhangjie_index']},data,True)
        print('存储完成')


if __name__ == '__main__':
    data = {'zhangjie_index': '3394976', 'zhangjie_name': '第二十二章 再回乡下', 'zhengwen': '\nfri\nmay\n29\n11:27:50\ncst\n2015\n\n\n其实当时我是很害怕的，不知道哪来的勇气和那鬼拼命，慢慢的，那鬼向我冲了过来，我捏紧七星剑，也冲上去了，我还没冲过去，我就怕了，因为她没有瞳孔，眼睛里只有眼珠，看起来可怕至极。\n\n\n我那年遇到的鬼都是有瞳孔的，爸爸都没有对付过，可是这个没有，我想掏出黑符，可是我手还没有伸进去，我就被她一把抓起来扔了三米多远，七星剑在我扔下来的同时，也震散了。\n\n\n我抓起一把就撒到了她的身上，她身上只是冒起了浓浓的白烟，并没有什么事，我马上站起来就跑，但我还没有跑几步，就被她抓住了，我立马掏出黑符，刚要往她身上贴，可是她发现了黑符对她有威胁，就转身逃跑了，我刚要追，却发现自己的腿吓得的动不了了。我慢慢的站起来，然后把黑符装到了我刚才拿的那个包里，然后捶了几下腿，渐渐的，那种感觉消失了，我就朝她逃跑的方向追去，因为那个方向正是张婶家。\n\n\n我用最快的速度追上了她，还好，她把张婶家给越过了，不过，刘颜发现了我，推门出来了，我马上让她进去，可是迟了，那鬼发现了刘颜，冲着刘颜抓去，我不知道那里来的力量，掏出黑符，一个起身跳，就跳到了刘颜面前，把黑符贴在了那鬼身上，而我被那鬼的两个手穿透了身体，我用最后一口气念道：“急急如律令。”\n\n\n轰的一声，刘颜和我直接被轰到了屋子里面，那鬼却没有死，逃跑了，我想了起来，我没有把符贴到她的鬼门上，我这时也坚持不住了，刘颜立马抱紧了我，说：“都怪我，我要是不出去，你也就不会受伤了，你在坚持一会，我马上送你去医院。”\n\n\n不知不觉，我睡了过去，等我醒来的时候，我在一片黑暗之中，前面只有一点光，可是我努力朝着那点有光处走，就是走不到，我很吃力的往前走，慢慢的，那点光变大了，最后变成了一个和排水口一样，而我就在排水管里。\n\n\n我想了想，不对呀，我不是和那鬼大战着呢吗，怎么会在这里，是不是刘颜把我扔到了排水管里。\n\n\n我坚决摇头，不会的，刘颜怎么可能会把我扔到排水管里头。是于不是，只有下去了才知道，我往下一看，妈呀，这可是万仗高的悬崖，让我怎么跳，只有坐下等了。\n\n\n过了一会，一个老爷爷走了过来，我问道：“爷爷，这里是那里啊！你怎么也在这里？”\n\n\n那老头说：“年轻人，你还不知道吧！这里就是通往地府的无光之路啊，好了，不说了，我赶着投胎呢，迟了可就不好了。”说完，那个老人跳了下去。\n\n\n天呐，不会吧，我这么快就死了，我不自觉的哭了起来。\n\n\n人生自古谁无死，留取丹心照汗青，突然想起了文天祥的这句话，不行，我不能死，我还有很多事情没做呢。\n\n\n我刚要往后走，可是我却看到了很多的手从墙里伸了出来，还有许多向幽灵一样的声音传了出来：“你想要往哪走，来陪我们一起在这里守候寂寞吧！”\n\n\n我吓得一下就跳了下去，等我睁开眼睛的时候，这里有很多人，都在排队领什么东西，我也跟上了，排了一会，终于到我了，那个可能是鬼差，那鬼差让我把手指按到一张纸上，我照做了，突然出现了很多我的档案，那鬼差念了出来。\n\n\n张远，生于一九八三年，被父母抛弃，然后被张正刚的捡到，收养，十六岁那年，遇到了一个红衣女鬼，张正刚为了保护他，最后和那红衣女鬼同归于尽，就在今天，张远和一个极阴极煞苦斗，最后被极阴极煞用双手穿胸而死，极阴极煞受了重伤而逃，而张远来到了阴市半步多报道。\n\n\n“好了，这是你的鬼心，拿着去投胎吧！”那鬼差讲完之后说道。\n\n\n哦，原来那鬼是极阴极煞，我说怎么那么厉害呢。\n\n\n那鬼差递给了我一个和心差不多的东西，然后就让我通过了，我拿着一个自己的资料，和一个叫鬼心的就走到了一个客栈里，跟古时候的一摸一样。\n\n\n里面坐满了人，我找了一个看起来四十几岁的人问道：“这里是干什么的？”\n\n\n那人说：“我们都在等赶往送我们去阴市中心的火车。”\n\n\n我‘哦’了一声就找了一个位置坐下了。\n', 'shu_name': '灵异驱鬼师'}
    c = Mongo_Database()
    c.insert_data(data)